{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "metadata_in_weights" : [

  ],
  "layers" : [
    {
      "weights" : {

      },
      "target_size_w" : 224,
      "grid_sampling_mode" : 1,
      "crop_index_mode" : 0,
      "spatial_scale" : 1,
      "type" : "crop_and_resize",
      "mode" : 1,
      "resized_dims" : 0,
      "bottom" : "input_image",
      "debug_info" : "Upsample_0",
      "target_size_h" : 128,
      "name" : "Upsample_0",
      "top" : "374"
    },
    {
      "bottom" : "",
      "k" : 1,
      "n" : 1,
      "weights" : {

      },
      "h" : 1,
      "debug_info" : "375",
      "constant_blob" : 1,
      "top" : "375",
      "w" : 1,
      "type" : "load_constant",
      "name" : "375"
    },
    {
      "bottom" : "375",
      "alpha" : 1,
      "operation" : 10,
      "eps" : 9.9999997473787516e-05,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Div_2_inverse",
      "top" : "375_inverse",
      "type" : "elementwise",
      "name" : "Div_2_inverse",
      "beta" : 0
    },
    {
      "bottom" : "374,375_inverse",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Div_2",
      "top" : "376",
      "type" : "elementwise",
      "name" : "Div_2",
      "beta" : 0
    },
    {
      "bottom" : "",
      "k" : 1,
      "n" : 1,
      "weights" : {

      },
      "h" : 1,
      "debug_info" : "377",
      "constant_blob" : 3,
      "top" : "377",
      "w" : 1,
      "type" : "load_constant",
      "name" : "377"
    },
    {
      "bottom" : "377",
      "alpha" : -1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Sub_4_neg",
      "top" : "377_neg",
      "type" : "elementwise",
      "name" : "Sub_4_neg",
      "beta" : 0
    },
    {
      "bottom" : "376,377_neg",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Sub_4",
      "top" : "378",
      "type" : "elementwise",
      "name" : "Sub_4",
      "beta" : 0
    },
    {
      "bottom" : "",
      "k" : 1,
      "n" : 1,
      "weights" : {

      },
      "h" : 1,
      "debug_info" : "379",
      "constant_blob" : 5,
      "top" : "379",
      "w" : 1,
      "type" : "load_constant",
      "name" : "379"
    },
    {
      "bottom" : "379",
      "alpha" : 1,
      "operation" : 10,
      "eps" : 9.9999997473787516e-05,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Div_6_inverse",
      "top" : "379_inverse",
      "type" : "elementwise",
      "name" : "Div_6_inverse",
      "beta" : 0
    },
    {
      "bottom" : "378,379_inverse",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Div_6",
      "top" : "380",
      "type" : "elementwise",
      "name" : "Div_6",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_7",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "572",
      "K" : 4,
      "blob_biases" : 7,
      "stride_x" : 2,
      "name" : "Conv_7",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "380",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 9
    },
    {
      "bottom" : "572",
      "alpha" : 0,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_8_min_x_a",
      "top" : "572_min_x_a",
      "type" : "elementwise",
      "name" : "Clip_8_min_x_a",
      "beta" : 0
    },
    {
      "bottom" : "572_min_x_a",
      "alpha" : -1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_8_min_minus_x_minus_b",
      "top" : "572_min_x_a_13_post_scale",
      "type" : "elementwise",
      "name" : "Clip_8_min_minus_x_minus_b_scale",
      "beta" : 0
    },
    {
      "bottom" : "572_min_x_a_13_post_scale",
      "alpha" : 0,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_8_min_minus_x_minus_b",
      "top" : "572_min_x_a_13_post_scale_shift",
      "type" : "elementwise",
      "name" : "Clip_8_min_minus_x_minus_b_shift",
      "beta" : 0
    },
    {
      "bottom" : "572_min_x_a_13_post_scale_shift",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_8_min_minus_x_minus_b",
      "top" : "572_min_minus_x_minus_b",
      "type" : "elementwise",
      "name" : "Clip_8_min_minus_x_minus_b",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "572_min_minus_x_minus_b",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "Clip_8",
      "top" : "383",
      "type" : "activation",
      "name" : "Clip_8",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_9",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "575",
      "K" : 32,
      "blob_biases" : 11,
      "name" : "Conv_9",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "383",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 13
    },
    {
      "bottom" : "575",
      "alpha" : 0,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_10_min_x_a",
      "top" : "575_min_x_a",
      "type" : "elementwise",
      "name" : "Clip_10_min_x_a",
      "beta" : 0
    },
    {
      "bottom" : "575_min_x_a",
      "alpha" : -1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_10_min_minus_x_minus_b",
      "top" : "575_min_x_a_17_post_scale",
      "type" : "elementwise",
      "name" : "Clip_10_min_minus_x_minus_b_scale",
      "beta" : 0
    },
    {
      "bottom" : "575_min_x_a_17_post_scale",
      "alpha" : 0,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_10_min_minus_x_minus_b",
      "top" : "575_min_x_a_17_post_scale_shift",
      "type" : "elementwise",
      "name" : "Clip_10_min_minus_x_minus_b_shift",
      "beta" : 0
    },
    {
      "bottom" : "575_min_x_a_17_post_scale_shift",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_10_min_minus_x_minus_b",
      "top" : "575_min_minus_x_minus_b",
      "type" : "elementwise",
      "name" : "Clip_10_min_minus_x_minus_b",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "575_min_minus_x_minus_b",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "Clip_10",
      "top" : "386",
      "type" : "activation",
      "name" : "Clip_10",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_11",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "578",
      "K" : 32,
      "blob_biases" : 15,
      "name" : "Conv_11",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "386",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 17
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_12",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "581",
      "K" : 16,
      "blob_biases" : 19,
      "name" : "Conv_12",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "578",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 21
    },
    {
      "bottom" : "581",
      "alpha" : 0,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_13_min_x_a",
      "top" : "581_min_x_a",
      "type" : "elementwise",
      "name" : "Clip_13_min_x_a",
      "beta" : 0
    },
    {
      "bottom" : "581_min_x_a",
      "alpha" : -1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_13_min_minus_x_minus_b",
      "top" : "581_min_x_a_22_post_scale",
      "type" : "elementwise",
      "name" : "Clip_13_min_minus_x_minus_b_scale",
      "beta" : 0
    },
    {
      "bottom" : "581_min_x_a_22_post_scale",
      "alpha" : 0,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_13_min_minus_x_minus_b",
      "top" : "581_min_x_a_22_post_scale_shift",
      "type" : "elementwise",
      "name" : "Clip_13_min_minus_x_minus_b_shift",
      "beta" : 0
    },
    {
      "bottom" : "581_min_x_a_22_post_scale_shift",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_13_min_minus_x_minus_b",
      "top" : "581_min_minus_x_minus_b",
      "type" : "elementwise",
      "name" : "Clip_13_min_minus_x_minus_b",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "581_min_minus_x_minus_b",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "Clip_13",
      "top" : "391",
      "type" : "activation",
      "name" : "Clip_13",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_14",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "584",
      "K" : 96,
      "blob_biases" : 23,
      "stride_x" : 2,
      "name" : "Conv_14",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 96,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "391",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 25
    },
    {
      "bottom" : "584",
      "alpha" : 0,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_15_min_x_a",
      "top" : "584_min_x_a",
      "type" : "elementwise",
      "name" : "Clip_15_min_x_a",
      "beta" : 0
    },
    {
      "bottom" : "584_min_x_a",
      "alpha" : -1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_15_min_minus_x_minus_b",
      "top" : "584_min_x_a_26_post_scale",
      "type" : "elementwise",
      "name" : "Clip_15_min_minus_x_minus_b_scale",
      "beta" : 0
    },
    {
      "bottom" : "584_min_x_a_26_post_scale",
      "alpha" : 0,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_15_min_minus_x_minus_b",
      "top" : "584_min_x_a_26_post_scale_shift",
      "type" : "elementwise",
      "name" : "Clip_15_min_minus_x_minus_b_shift",
      "beta" : 0
    },
    {
      "bottom" : "584_min_x_a_26_post_scale_shift",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_15_min_minus_x_minus_b",
      "top" : "584_min_minus_x_minus_b",
      "type" : "elementwise",
      "name" : "Clip_15_min_minus_x_minus_b",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "584_min_minus_x_minus_b",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "Clip_15",
      "top" : "394",
      "type" : "activation",
      "name" : "Clip_15",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_16",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "587",
      "K" : 96,
      "blob_biases" : 27,
      "name" : "Conv_16",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "394",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 29
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_17",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "590",
      "K" : 24,
      "blob_biases" : 31,
      "name" : "Conv_17",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "587",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 33
    },
    {
      "bottom" : "590",
      "alpha" : 0,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_18_min_x_a",
      "top" : "590_min_x_a",
      "type" : "elementwise",
      "name" : "Clip_18_min_x_a",
      "beta" : 0
    },
    {
      "bottom" : "590_min_x_a",
      "alpha" : -1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_18_min_minus_x_minus_b",
      "top" : "590_min_x_a_31_post_scale",
      "type" : "elementwise",
      "name" : "Clip_18_min_minus_x_minus_b_scale",
      "beta" : 0
    },
    {
      "bottom" : "590_min_x_a_31_post_scale",
      "alpha" : 0,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_18_min_minus_x_minus_b",
      "top" : "590_min_x_a_31_post_scale_shift",
      "type" : "elementwise",
      "name" : "Clip_18_min_minus_x_minus_b_shift",
      "beta" : 0
    },
    {
      "bottom" : "590_min_x_a_31_post_scale_shift",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_18_min_minus_x_minus_b",
      "top" : "590_min_minus_x_minus_b",
      "type" : "elementwise",
      "name" : "Clip_18_min_minus_x_minus_b",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "590_min_minus_x_minus_b",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "Clip_18",
      "top" : "399",
      "type" : "activation",
      "name" : "Clip_18",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_19",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "593",
      "K" : 144,
      "blob_biases" : 35,
      "name" : "Conv_19",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 144,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "399",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 37
    },
    {
      "bottom" : "593",
      "alpha" : 0,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_20_min_x_a",
      "top" : "593_min_x_a",
      "type" : "elementwise",
      "name" : "Clip_20_min_x_a",
      "beta" : 0
    },
    {
      "bottom" : "593_min_x_a",
      "alpha" : -1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_20_min_minus_x_minus_b",
      "top" : "593_min_x_a_35_post_scale",
      "type" : "elementwise",
      "name" : "Clip_20_min_minus_x_minus_b_scale",
      "beta" : 0
    },
    {
      "bottom" : "593_min_x_a_35_post_scale",
      "alpha" : 0,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_20_min_minus_x_minus_b",
      "top" : "593_min_x_a_35_post_scale_shift",
      "type" : "elementwise",
      "name" : "Clip_20_min_minus_x_minus_b_shift",
      "beta" : 0
    },
    {
      "bottom" : "593_min_x_a_35_post_scale_shift",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_20_min_minus_x_minus_b",
      "top" : "593_min_minus_x_minus_b",
      "type" : "elementwise",
      "name" : "Clip_20_min_minus_x_minus_b",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "593_min_minus_x_minus_b",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "Clip_20",
      "top" : "402",
      "type" : "activation",
      "name" : "Clip_20",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_21",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "596",
      "K" : 144,
      "blob_biases" : 39,
      "name" : "Conv_21",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "402",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 41
    },
    {
      "bottom" : "587,596",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Add_22",
      "top" : "405",
      "type" : "elementwise",
      "name" : "Add_22",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_23",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "599",
      "K" : 24,
      "blob_biases" : 43,
      "name" : "Conv_23",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "405",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 45
    },
    {
      "bottom" : "599",
      "alpha" : 0,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_24_min_x_a",
      "top" : "599_min_x_a",
      "type" : "elementwise",
      "name" : "Clip_24_min_x_a",
      "beta" : 0
    },
    {
      "bottom" : "599_min_x_a",
      "alpha" : -1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_24_min_minus_x_minus_b",
      "top" : "599_min_x_a_41_post_scale",
      "type" : "elementwise",
      "name" : "Clip_24_min_minus_x_minus_b_scale",
      "beta" : 0
    },
    {
      "bottom" : "599_min_x_a_41_post_scale",
      "alpha" : 0,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_24_min_minus_x_minus_b",
      "top" : "599_min_x_a_41_post_scale_shift",
      "type" : "elementwise",
      "name" : "Clip_24_min_minus_x_minus_b_shift",
      "beta" : 0
    },
    {
      "bottom" : "599_min_x_a_41_post_scale_shift",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_24_min_minus_x_minus_b",
      "top" : "599_min_minus_x_minus_b",
      "type" : "elementwise",
      "name" : "Clip_24_min_minus_x_minus_b",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "599_min_minus_x_minus_b",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "Clip_24",
      "top" : "408",
      "type" : "activation",
      "name" : "Clip_24",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_25",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "602",
      "K" : 144,
      "blob_biases" : 47,
      "stride_x" : 2,
      "name" : "Conv_25",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 144,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "408",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 49
    },
    {
      "bottom" : "602",
      "alpha" : 0,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_26_min_x_a",
      "top" : "602_min_x_a",
      "type" : "elementwise",
      "name" : "Clip_26_min_x_a",
      "beta" : 0
    },
    {
      "bottom" : "602_min_x_a",
      "alpha" : -1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_26_min_minus_x_minus_b",
      "top" : "602_min_x_a_45_post_scale",
      "type" : "elementwise",
      "name" : "Clip_26_min_minus_x_minus_b_scale",
      "beta" : 0
    },
    {
      "bottom" : "602_min_x_a_45_post_scale",
      "alpha" : 0,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_26_min_minus_x_minus_b",
      "top" : "602_min_x_a_45_post_scale_shift",
      "type" : "elementwise",
      "name" : "Clip_26_min_minus_x_minus_b_shift",
      "beta" : 0
    },
    {
      "bottom" : "602_min_x_a_45_post_scale_shift",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_26_min_minus_x_minus_b",
      "top" : "602_min_minus_x_minus_b",
      "type" : "elementwise",
      "name" : "Clip_26_min_minus_x_minus_b",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "602_min_minus_x_minus_b",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "Clip_26",
      "top" : "411",
      "type" : "activation",
      "name" : "Clip_26",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_27",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "605",
      "K" : 144,
      "blob_biases" : 51,
      "name" : "Conv_27",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "411",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 53
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_28",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "608",
      "K" : 32,
      "blob_biases" : 55,
      "name" : "Conv_28",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "605",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 57
    },
    {
      "bottom" : "608",
      "alpha" : 0,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_29_min_x_a",
      "top" : "608_min_x_a",
      "type" : "elementwise",
      "name" : "Clip_29_min_x_a",
      "beta" : 0
    },
    {
      "bottom" : "608_min_x_a",
      "alpha" : -1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_29_min_minus_x_minus_b",
      "top" : "608_min_x_a_50_post_scale",
      "type" : "elementwise",
      "name" : "Clip_29_min_minus_x_minus_b_scale",
      "beta" : 0
    },
    {
      "bottom" : "608_min_x_a_50_post_scale",
      "alpha" : 0,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_29_min_minus_x_minus_b",
      "top" : "608_min_x_a_50_post_scale_shift",
      "type" : "elementwise",
      "name" : "Clip_29_min_minus_x_minus_b_shift",
      "beta" : 0
    },
    {
      "bottom" : "608_min_x_a_50_post_scale_shift",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_29_min_minus_x_minus_b",
      "top" : "608_min_minus_x_minus_b",
      "type" : "elementwise",
      "name" : "Clip_29_min_minus_x_minus_b",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "608_min_minus_x_minus_b",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "Clip_29",
      "top" : "416",
      "type" : "activation",
      "name" : "Clip_29",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_30",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "611",
      "K" : 192,
      "blob_biases" : 59,
      "name" : "Conv_30",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 192,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "416",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 61
    },
    {
      "bottom" : "611",
      "alpha" : 0,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_31_min_x_a",
      "top" : "611_min_x_a",
      "type" : "elementwise",
      "name" : "Clip_31_min_x_a",
      "beta" : 0
    },
    {
      "bottom" : "611_min_x_a",
      "alpha" : -1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_31_min_minus_x_minus_b",
      "top" : "611_min_x_a_54_post_scale",
      "type" : "elementwise",
      "name" : "Clip_31_min_minus_x_minus_b_scale",
      "beta" : 0
    },
    {
      "bottom" : "611_min_x_a_54_post_scale",
      "alpha" : 0,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_31_min_minus_x_minus_b",
      "top" : "611_min_x_a_54_post_scale_shift",
      "type" : "elementwise",
      "name" : "Clip_31_min_minus_x_minus_b_shift",
      "beta" : 0
    },
    {
      "bottom" : "611_min_x_a_54_post_scale_shift",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_31_min_minus_x_minus_b",
      "top" : "611_min_minus_x_minus_b",
      "type" : "elementwise",
      "name" : "Clip_31_min_minus_x_minus_b",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "611_min_minus_x_minus_b",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "Clip_31",
      "top" : "419",
      "type" : "activation",
      "name" : "Clip_31",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_32",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "614",
      "K" : 192,
      "blob_biases" : 63,
      "name" : "Conv_32",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "419",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 65
    },
    {
      "bottom" : "605,614",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Add_33",
      "top" : "422",
      "type" : "elementwise",
      "name" : "Add_33",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_34",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "617",
      "K" : 32,
      "blob_biases" : 67,
      "name" : "Conv_34",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "422",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 69
    },
    {
      "bottom" : "617",
      "alpha" : 0,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_35_min_x_a",
      "top" : "617_min_x_a",
      "type" : "elementwise",
      "name" : "Clip_35_min_x_a",
      "beta" : 0
    },
    {
      "bottom" : "617_min_x_a",
      "alpha" : -1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_35_min_minus_x_minus_b",
      "top" : "617_min_x_a_60_post_scale",
      "type" : "elementwise",
      "name" : "Clip_35_min_minus_x_minus_b_scale",
      "beta" : 0
    },
    {
      "bottom" : "617_min_x_a_60_post_scale",
      "alpha" : 0,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_35_min_minus_x_minus_b",
      "top" : "617_min_x_a_60_post_scale_shift",
      "type" : "elementwise",
      "name" : "Clip_35_min_minus_x_minus_b_shift",
      "beta" : 0
    },
    {
      "bottom" : "617_min_x_a_60_post_scale_shift",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_35_min_minus_x_minus_b",
      "top" : "617_min_minus_x_minus_b",
      "type" : "elementwise",
      "name" : "Clip_35_min_minus_x_minus_b",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "617_min_minus_x_minus_b",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "Clip_35",
      "top" : "425",
      "type" : "activation",
      "name" : "Clip_35",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_36",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "620",
      "K" : 192,
      "blob_biases" : 71,
      "name" : "Conv_36",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 192,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "425",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 73
    },
    {
      "bottom" : "620",
      "alpha" : 0,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_37_min_x_a",
      "top" : "620_min_x_a",
      "type" : "elementwise",
      "name" : "Clip_37_min_x_a",
      "beta" : 0
    },
    {
      "bottom" : "620_min_x_a",
      "alpha" : -1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_37_min_minus_x_minus_b",
      "top" : "620_min_x_a_64_post_scale",
      "type" : "elementwise",
      "name" : "Clip_37_min_minus_x_minus_b_scale",
      "beta" : 0
    },
    {
      "bottom" : "620_min_x_a_64_post_scale",
      "alpha" : 0,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_37_min_minus_x_minus_b",
      "top" : "620_min_x_a_64_post_scale_shift",
      "type" : "elementwise",
      "name" : "Clip_37_min_minus_x_minus_b_shift",
      "beta" : 0
    },
    {
      "bottom" : "620_min_x_a_64_post_scale_shift",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_37_min_minus_x_minus_b",
      "top" : "620_min_minus_x_minus_b",
      "type" : "elementwise",
      "name" : "Clip_37_min_minus_x_minus_b",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "620_min_minus_x_minus_b",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "Clip_37",
      "top" : "428",
      "type" : "activation",
      "name" : "Clip_37",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_38",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "623",
      "K" : 192,
      "blob_biases" : 75,
      "name" : "Conv_38",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "428",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 77
    },
    {
      "bottom" : "422,623",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Add_39",
      "top" : "431",
      "type" : "elementwise",
      "name" : "Add_39",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_40",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "626",
      "K" : 32,
      "blob_biases" : 79,
      "name" : "Conv_40",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "431",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 81
    },
    {
      "bottom" : "626",
      "alpha" : 0,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_41_min_x_a",
      "top" : "626_min_x_a",
      "type" : "elementwise",
      "name" : "Clip_41_min_x_a",
      "beta" : 0
    },
    {
      "bottom" : "626_min_x_a",
      "alpha" : -1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_41_min_minus_x_minus_b",
      "top" : "626_min_x_a_70_post_scale",
      "type" : "elementwise",
      "name" : "Clip_41_min_minus_x_minus_b_scale",
      "beta" : 0
    },
    {
      "bottom" : "626_min_x_a_70_post_scale",
      "alpha" : 0,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_41_min_minus_x_minus_b",
      "top" : "626_min_x_a_70_post_scale_shift",
      "type" : "elementwise",
      "name" : "Clip_41_min_minus_x_minus_b_shift",
      "beta" : 0
    },
    {
      "bottom" : "626_min_x_a_70_post_scale_shift",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_41_min_minus_x_minus_b",
      "top" : "626_min_minus_x_minus_b",
      "type" : "elementwise",
      "name" : "Clip_41_min_minus_x_minus_b",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "626_min_minus_x_minus_b",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "Clip_41",
      "top" : "434",
      "type" : "activation",
      "name" : "Clip_41",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_42",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "629",
      "K" : 192,
      "blob_biases" : 83,
      "stride_x" : 2,
      "name" : "Conv_42",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 192,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "434",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 85
    },
    {
      "bottom" : "629",
      "alpha" : 0,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_43_min_x_a",
      "top" : "629_min_x_a",
      "type" : "elementwise",
      "name" : "Clip_43_min_x_a",
      "beta" : 0
    },
    {
      "bottom" : "629_min_x_a",
      "alpha" : -1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_43_min_minus_x_minus_b",
      "top" : "629_min_x_a_74_post_scale",
      "type" : "elementwise",
      "name" : "Clip_43_min_minus_x_minus_b_scale",
      "beta" : 0
    },
    {
      "bottom" : "629_min_x_a_74_post_scale",
      "alpha" : 0,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_43_min_minus_x_minus_b",
      "top" : "629_min_x_a_74_post_scale_shift",
      "type" : "elementwise",
      "name" : "Clip_43_min_minus_x_minus_b_shift",
      "beta" : 0
    },
    {
      "bottom" : "629_min_x_a_74_post_scale_shift",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_43_min_minus_x_minus_b",
      "top" : "629_min_minus_x_minus_b",
      "type" : "elementwise",
      "name" : "Clip_43_min_minus_x_minus_b",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "629_min_minus_x_minus_b",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "Clip_43",
      "top" : "437",
      "type" : "activation",
      "name" : "Clip_43",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_44",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "632",
      "K" : 192,
      "blob_biases" : 87,
      "name" : "Conv_44",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "437",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 89
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_45",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "635",
      "K" : 64,
      "blob_biases" : 91,
      "name" : "Conv_45",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "632",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 93
    },
    {
      "bottom" : "635",
      "alpha" : 0,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_46_min_x_a",
      "top" : "635_min_x_a",
      "type" : "elementwise",
      "name" : "Clip_46_min_x_a",
      "beta" : 0
    },
    {
      "bottom" : "635_min_x_a",
      "alpha" : -1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_46_min_minus_x_minus_b",
      "top" : "635_min_x_a_79_post_scale",
      "type" : "elementwise",
      "name" : "Clip_46_min_minus_x_minus_b_scale",
      "beta" : 0
    },
    {
      "bottom" : "635_min_x_a_79_post_scale",
      "alpha" : 0,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_46_min_minus_x_minus_b",
      "top" : "635_min_x_a_79_post_scale_shift",
      "type" : "elementwise",
      "name" : "Clip_46_min_minus_x_minus_b_shift",
      "beta" : 0
    },
    {
      "bottom" : "635_min_x_a_79_post_scale_shift",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_46_min_minus_x_minus_b",
      "top" : "635_min_minus_x_minus_b",
      "type" : "elementwise",
      "name" : "Clip_46_min_minus_x_minus_b",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "635_min_minus_x_minus_b",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "Clip_46",
      "top" : "442",
      "type" : "activation",
      "name" : "Clip_46",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_47",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "638",
      "K" : 384,
      "blob_biases" : 95,
      "name" : "Conv_47",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 384,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "442",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 97
    },
    {
      "bottom" : "638",
      "alpha" : 0,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_48_min_x_a",
      "top" : "638_min_x_a",
      "type" : "elementwise",
      "name" : "Clip_48_min_x_a",
      "beta" : 0
    },
    {
      "bottom" : "638_min_x_a",
      "alpha" : -1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_48_min_minus_x_minus_b",
      "top" : "638_min_x_a_83_post_scale",
      "type" : "elementwise",
      "name" : "Clip_48_min_minus_x_minus_b_scale",
      "beta" : 0
    },
    {
      "bottom" : "638_min_x_a_83_post_scale",
      "alpha" : 0,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_48_min_minus_x_minus_b",
      "top" : "638_min_x_a_83_post_scale_shift",
      "type" : "elementwise",
      "name" : "Clip_48_min_minus_x_minus_b_shift",
      "beta" : 0
    },
    {
      "bottom" : "638_min_x_a_83_post_scale_shift",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_48_min_minus_x_minus_b",
      "top" : "638_min_minus_x_minus_b",
      "type" : "elementwise",
      "name" : "Clip_48_min_minus_x_minus_b",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "638_min_minus_x_minus_b",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "Clip_48",
      "top" : "445",
      "type" : "activation",
      "name" : "Clip_48",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_49",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "641",
      "K" : 384,
      "blob_biases" : 99,
      "name" : "Conv_49",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "445",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 101
    },
    {
      "bottom" : "632,641",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Add_50",
      "top" : "448",
      "type" : "elementwise",
      "name" : "Add_50",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_51",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "644",
      "K" : 64,
      "blob_biases" : 103,
      "name" : "Conv_51",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "448",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 105
    },
    {
      "bottom" : "644",
      "alpha" : 0,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_52_min_x_a",
      "top" : "644_min_x_a",
      "type" : "elementwise",
      "name" : "Clip_52_min_x_a",
      "beta" : 0
    },
    {
      "bottom" : "644_min_x_a",
      "alpha" : -1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_52_min_minus_x_minus_b",
      "top" : "644_min_x_a_89_post_scale",
      "type" : "elementwise",
      "name" : "Clip_52_min_minus_x_minus_b_scale",
      "beta" : 0
    },
    {
      "bottom" : "644_min_x_a_89_post_scale",
      "alpha" : 0,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_52_min_minus_x_minus_b",
      "top" : "644_min_x_a_89_post_scale_shift",
      "type" : "elementwise",
      "name" : "Clip_52_min_minus_x_minus_b_shift",
      "beta" : 0
    },
    {
      "bottom" : "644_min_x_a_89_post_scale_shift",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_52_min_minus_x_minus_b",
      "top" : "644_min_minus_x_minus_b",
      "type" : "elementwise",
      "name" : "Clip_52_min_minus_x_minus_b",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "644_min_minus_x_minus_b",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "Clip_52",
      "top" : "451",
      "type" : "activation",
      "name" : "Clip_52",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_53",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "647",
      "K" : 384,
      "blob_biases" : 107,
      "name" : "Conv_53",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 384,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "451",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 109
    },
    {
      "bottom" : "647",
      "alpha" : 0,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_54_min_x_a",
      "top" : "647_min_x_a",
      "type" : "elementwise",
      "name" : "Clip_54_min_x_a",
      "beta" : 0
    },
    {
      "bottom" : "647_min_x_a",
      "alpha" : -1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_54_min_minus_x_minus_b",
      "top" : "647_min_x_a_93_post_scale",
      "type" : "elementwise",
      "name" : "Clip_54_min_minus_x_minus_b_scale",
      "beta" : 0
    },
    {
      "bottom" : "647_min_x_a_93_post_scale",
      "alpha" : 0,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_54_min_minus_x_minus_b",
      "top" : "647_min_x_a_93_post_scale_shift",
      "type" : "elementwise",
      "name" : "Clip_54_min_minus_x_minus_b_shift",
      "beta" : 0
    },
    {
      "bottom" : "647_min_x_a_93_post_scale_shift",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_54_min_minus_x_minus_b",
      "top" : "647_min_minus_x_minus_b",
      "type" : "elementwise",
      "name" : "Clip_54_min_minus_x_minus_b",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "647_min_minus_x_minus_b",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "Clip_54",
      "top" : "454",
      "type" : "activation",
      "name" : "Clip_54",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_55",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "650",
      "K" : 384,
      "blob_biases" : 111,
      "name" : "Conv_55",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "454",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 113
    },
    {
      "bottom" : "448,650",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Add_56",
      "top" : "457",
      "type" : "elementwise",
      "name" : "Add_56",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_57",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "653",
      "K" : 64,
      "blob_biases" : 115,
      "name" : "Conv_57",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "457",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 117
    },
    {
      "bottom" : "653",
      "alpha" : 0,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_58_min_x_a",
      "top" : "653_min_x_a",
      "type" : "elementwise",
      "name" : "Clip_58_min_x_a",
      "beta" : 0
    },
    {
      "bottom" : "653_min_x_a",
      "alpha" : -1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Clip_58_min_minus_x_minus_b",
      "top" : "653_min_x_a_99_post_scale",
      "type" : "elementwise",
      "name" : "Clip_58_min_minus_x_minus_b_scale",
      "beta" : 0
    },
