<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>files</key>
	<dict>
		<key>Headers/BroadcastUtil.h</key>
		<data>
		0UyRNKjRbATdGFlAyC3aZ25jmlA=
		</data>
		<key>Headers/SparkVideoLayer.h</key>
		<data>
		YZ3OQ1bnmS36ZWBVfiL0QhI5at8=
		</data>
		<key>Headers/WebexBroadcastCallServerProtocol.h</key>
		<data>
		UuGvyApzHhNDHb1lx95HLT3M3HE=
		</data>
		<key>Headers/WebexSDK-Swift.h</key>
		<data>
		/1jtbS82R5Dn2VD5KGPBIjA0Fgc=
		</data>
		<key>Headers/WebexSDK.h</key>
		<data>
		EyYdEwlTUycgZ71r0sBZxm1NVtc=
		</data>
		<key>Info.plist</key>
		<data>
		Dly5BMA6w0Q+E8+ahElQxaxszKg=
		</data>
		<key>Modules/WebexSDK.swiftmodule/Project/x86_64-apple-ios-simulator.swiftsourceinfo</key>
		<data>
		FRQEjgYlo/HX/0b0RjjzbdnY8AY=
		</data>
		<key>Modules/WebexSDK.swiftmodule/x86_64-apple-ios-simulator.abi.json</key>
		<data>
		s3RkFDEnerr4/0bZTuUtGCw2IP4=
		</data>
		<key>Modules/WebexSDK.swiftmodule/x86_64-apple-ios-simulator.private.swiftinterface</key>
		<data>
		Yken/XwwwqKY0cwg398tENrL4Eo=
		</data>
		<key>Modules/WebexSDK.swiftmodule/x86_64-apple-ios-simulator.swiftdoc</key>
		<data>
		dMUr4dQwb4O5YfkVzpJZ7K2ygII=
		</data>
		<key>Modules/WebexSDK.swiftmodule/x86_64-apple-ios-simulator.swiftinterface</key>
		<data>
		Yken/XwwwqKY0cwg398tENrL4Eo=
		</data>
		<key>Modules/WebexSDK.swiftmodule/x86_64-apple-ios-simulator.swiftmodule</key>
		<data>
		NV2kqLgajnm3S2XFGYnrzqFHvqo=
		</data>
		<key>Modules/module.modulemap</key>
		<data>
		K1xxGx++cpDbqQ3tX8kQ6Nkzb8o=
		</data>
		<key>PortraitSeg.mlmodelc/analytics/coremldata.bin</key>
		<data>
		bDdOEtNogAurDy7MbEC6Lr3mLPY=
		</data>
		<key>PortraitSeg.mlmodelc/coremldata.bin</key>
		<data>
		f40N9H0cmR9lAeSMlJZsxCKZK7k=
		</data>
		<key>PortraitSeg.mlmodelc/metadata.json</key>
		<data>
		xwNqU2nj9I+41Eg5kyi1L4NF02I=
		</data>
		<key>PortraitSeg.mlmodelc/model.espresso.net</key>
		<data>
		AAgiJSpZq7g4Gw99YlOLFdTao+A=
		</data>
		<key>PortraitSeg.mlmodelc/model.espresso.shape</key>
		<data>
		2krFQtXHNuG5gPrUBtkkShAf8rM=
		</data>
		<key>PortraitSeg.mlmodelc/model.espresso.weights</key>
		<data>
		s7Oj628Uz2Zpw6XlAKcLIzcctfA=
		</data>
		<key>PortraitSeg.mlmodelc/model/coremldata.bin</key>
		<data>
		CtJpF77nPI8rU32h4Ys3xjQJkl8=
		</data>
		<key>PortraitSeg.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
		<key>PortraitSegNew.mlmodelc/analytics/coremldata.bin</key>
		<data>
		TGtqFF5/aC0ZpIiHIuqBYH/+xQw=
		</data>
		<key>PortraitSegNew.mlmodelc/coremldata.bin</key>
		<data>
		5Kxk6LOmjbi3Vhi31IHW3uGKvHY=
		</data>
		<key>PortraitSegNew.mlmodelc/metadata.json</key>
		<data>
		30uAiqZLz+RAqw1jitIfje+0MZk=
		</data>
		<key>PortraitSegNew.mlmodelc/model.espresso.net</key>
		<data>
		lAZOR5sAzYroqkLy3stuo+SIXhY=
		</data>
		<key>PortraitSegNew.mlmodelc/model.espresso.shape</key>
		<data>
		fSClc1u5uf88gt9LkEPkHS1c5fU=
		</data>
		<key>PortraitSegNew.mlmodelc/model.espresso.weights</key>
		<data>
		JXYPzcAqzKuudxMqGtBJ+AX1ecQ=
		</data>
		<key>PortraitSegNew.mlmodelc/model/coremldata.bin</key>
		<data>
		yNfQ7w7t+oLS6hqlkoRbmm1LArc=
		</data>
		<key>PortraitSegNew.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
		<key>wseFilter.metallib</key>
		<data>
		ZkLvzOSEo70Yk9L99/7ahzPN05s=
		</data>
	</dict>
	<key>files2</key>
	<dict>
		<key>Headers/BroadcastUtil.h</key>
		<dict>
			<key>hash2</key>
			<data>
			Eu2GGv3TdHGsFpna5z4kOT4KdFyOHCB7mlBhsRQEQnw=
			</data>
		</dict>
		<key>Headers/SparkVideoLayer.h</key>
		<dict>
			<key>hash2</key>
			<data>
			n+kRpZUe37cb48UfjX9CW52FkvYIhp+FmTwvwjAhnzU=
			</data>
		</dict>
		<key>Headers/WebexBroadcastCallServerProtocol.h</key>
		<dict>
			<key>hash2</key>
			<data>
			NbbjIdI5QAJbt6UsuVw78jcloX8ajnfJpXUttcsSNA4=
			</data>
		</dict>
		<key>Headers/WebexSDK-Swift.h</key>
		<dict>
			<key>hash2</key>
			<data>
			i5CXFB0X/+bCJtGoLfZoj19JgrxOfue9Dr69cpO+M8E=
			</data>
		</dict>
		<key>Headers/WebexSDK.h</key>
		<dict>
			<key>hash2</key>
			<data>
			HM03lyU7utX8HzfmEJXxzgxCcCmEbw010tMI9yAAXeo=
			</data>
		</dict>
		<key>Modules/WebexSDK.swiftmodule/Project/x86_64-apple-ios-simulator.swiftsourceinfo</key>
		<dict>
			<key>hash2</key>
			<data>
			0bexuvQjfLyZYOoVtBd1kC97+ibDzTFVni+Q5foYJ1M=
			</data>
		</dict>
		<key>Modules/WebexSDK.swiftmodule/x86_64-apple-ios-simulator.abi.json</key>
		<dict>
			<key>hash2</key>
			<data>
			J3KBFuL3BOZJo8sRfg5qySpBKFvfS/LuMofNXgTMmgU=
			</data>
		</dict>
		<key>Modules/WebexSDK.swiftmodule/x86_64-apple-ios-simulator.private.swiftinterface</key>
		<dict>
			<key>hash2</key>
			<data>
			4++F3ZRHybkLcoywcTp4Vt8cVjirsVvQpOs//oasFZw=
			</data>
		</dict>
		<key>Modules/WebexSDK.swiftmodule/x86_64-apple-ios-simulator.swiftdoc</key>
		<dict>
			<key>hash2</key>
			<data>
			XfMWBy8iKyXkJbuSoIB7FrLp1yyzm42jDGkoLr3NNtw=
			</data>
		</dict>
		<key>Modules/WebexSDK.swiftmodule/x86_64-apple-ios-simulator.swiftinterface</key>
		<dict>
			<key>hash2</key>
			<data>
			4++F3ZRHybkLcoywcTp4Vt8cVjirsVvQpOs//oasFZw=
			</data>
		</dict>
		<key>Modules/WebexSDK.swiftmodule/x86_64-apple-ios-simulator.swiftmodule</key>
		<dict>
			<key>hash2</key>
			<data>
			VuGMSy59TxW6z18Q3W2RQu4s7u1Mf8mLKOPezfNIhEU=
			</data>
		</dict>
		<key>Modules/module.modulemap</key>
		<dict>
			<key>hash2</key>
			<data>
			WTbgRdo2qLpQWU3lIiCJtm7O1uSz7EggDzDF+wU6Mxc=
			</data>
		</dict>
		<key>PortraitSeg.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			qBj0aBrg7tPVaQvHuy3IW2md13VIjSm+4EsuXML5N1k=
			</data>
		</dict>
		<key>PortraitSeg.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			qco9zS9ZO5iIbs5lyA/R0cLtDwhZJkXNeJD4qfRJAMc=
			</data>
		</dict>
		<key>PortraitSeg.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			IuCRSIMrT+i83FlX64Je/ZWA6q9LqRDAMwK+U58cJkM=
			</data>
		</dict>
		<key>PortraitSeg.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			hjAmy4Y/gvY34gGHh4//f9xpiweywvvN7oSTuHOoiPE=
			</data>
		</dict>
		<key>PortraitSeg.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			jvFLKfGEGkEzsvSGgJ8NnIe+3hsMCbLfnSWvjqIyrts=
			</data>
		</dict>
		<key>PortraitSeg.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			5O/9jBDwzbTnKVAuyASyPtI7kNcTjpiOD821mZqh9a4=
			</data>
		</dict>
		<key>PortraitSeg.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			X48rdZ04ZyYsCj1UaG20h7knb6JkDM+6mnAoqve+Aps=
			</data>
		</dict>
		<key>PortraitSeg.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			LDTOHfI7g4xavyp/ZDfMo9MGftUJ/yXxHfaxG1grUes=
			</data>
		</dict>
		<key>PortraitSegNew.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			LeNOXYANgOXQVw2uzUVWl06XFpaBRyxyVV7Xw8f52FI=
			</data>
		</dict>
		<key>PortraitSegNew.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			7o/U+O08HjSFVbFCn6Zktfl0WZt83+NEMshHtaAbwWs=
			</data>
		</dict>
		<key>PortraitSegNew.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			OEb0m4q1KzSSBxv+HB25Te0TS+HT9QKUq5XLmRP2bYc=
			</data>
		</dict>
		<key>PortraitSegNew.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			3xCNlMhWbKmjmkYdlvQ5Ec/aXzZbwaMRKlXyDIk8rPA=
			</data>
		</dict>
		<key>PortraitSegNew.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			inZo8j5n8oTN+3gpnksMPwVytfppkmAQDXHeaz5tVu8=
			</data>
		</dict>
		<key>PortraitSegNew.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			NeOqIn32YeMiNKemlbmuc1tlJsL6cEhQhYjpnsxNcv0=
			</data>
		</dict>
		<key>PortraitSegNew.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			9aX9QtFqIDAnmO9u0wmXm0MAPSMg2fDo6pgxqSdZ+0s=
			</data>
		</dict>
		<key>PortraitSegNew.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			LDTOHfI7g4xavyp/ZDfMo9MGftUJ/yXxHfaxG1grUes=
			</data>
		</dict>
		<key>wseFilter.metallib</key>
		<dict>
			<key>hash2</key>
			<data>
			TSXSjqUuZ25exoDBM59443+fytMWWhIY6/kfZzvGkuY=
			</data>
		</dict>
	</dict>
	<key>rules</key>
	<dict>
		<key>^.*</key>
		<true/>
		<key>^.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^version.plist$</key>
		<true/>
	</dict>
	<key>rules2</key>
	<dict>
		<key>.*\.dSYM($|/)</key>
		<dict>
			<key>weight</key>
			<real>11</real>
		</dict>
		<key>^(.*/)?\.DS_Store$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>2000</real>
		</dict>
		<key>^.*</key>
		<true/>
		<key>^.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^Info\.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^PkgInfo$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^embedded\.provisionprofile$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^version\.plist$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
	</dict>
</dict>
</plist>
